// Училище: ТУЕС ( http://www.elsys-bg.org/ )
// Клас: 11 Б
// Номер: 16
// Име: Едуард Федев Калфов

/*Задача: Да се разработи програма, която изисква от потребителя да въведе целочислено число х, където 0<x<10.
Да се инициализира масив от 10 елемента. Да се намери сумата от cos(z) за всяко z в интервала [0;x) и да се запише като първи елемент в масива.
Да се намери сумата от cos(z) за всяко z в интервала [x; 2x) и да се запише като втори елемент в масива. Аналогично да се намерят сумите на cos(z) за всички интервали [Nx; (N+1)x ) и да се запишат като елемент N в масива за всяко N в интервала [0, 10).
 Масивът да се изведе на стандартния изход.
*/
#include <stdio.h>
#include <math.h>

int main(){
    int x,i,j,n;
    float a=0,arr[10];
    printf("Enter a number(0<x<10): ");
    scanf("%d",&x);
    for(i=0;i<x;i++){
      a=a+cos(x);
    }
    arr[0]=a;
    n=1;
    a=0;
    for(i=1;i<10;i++){
       for(j=x*n;j<(x*n)+1;j++){
        a=a+cos(j);
       }
       arr[i]=a;
       n++;
       a=0;

    }
     for(i=0;i<10;i++){
      printf("Number: %f\n",arr[i]);
    }
    scanf("%d",x);
    return 0;
}
