// Училище: ТУЕС ( http://www.elsys-bg.org/ )
// Клас: 11 Б
// Номер: 16
// Име: Едуард Федев Калфов

/*Задача: Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10.
Да се инициализира масив от 10 елемента. Да се намери първото число N в интервала [0; +∞) делящо се на х.
Да се намери сумата на всички числа в интервала [0; N] и да се запише като първи елемент в масива.
Да се намери второто число N' в интервала [0; +∞) делящо се на x.
Да се намери сумата на всички числа в интервала [0, N'] и да се запише като втори елемент в масива.
Аналогично да се запълнят и останалите елементи на масива. Масивът да се изведе на стандартния изход
*/

#include <stdio.h>

int main(){
     int x,i,j,n=0,y=0,count=0;
    float a=0,arr[10];
    printf("Enter a number(0<x<10): ");
    scanf("%d",&x);
    for(i=0;i<10;i++){
      arr[i]=0;
    }



    for(i=1;i<10000;i++){
      if(i%x==0){
        for(j=0;j<=i;j++){
          n=n+j;
        }
        if(count>10) break;
        arr[y]=n;
        n=0;
        y++;
        count++;
      }

    }
     for(i=0;i<10;i++){
      printf("Number: %f\n",arr[i]);
    }
    scanf("%d",x);


    return 0;
}
