// Училище: ТУЕС ( http://www.elsys-bg.org/ )
// Клас: 11 Б
// Номер: 16
// Име: Едуард Федев Калфов

/*Задача: Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10.
Да се инициализира масив от 10 елемента. Да се намери сумата от всички числа в интервала [0; 1000) делящи се на x и да се запише като първа стойност в масива.
Да се намери сумата от всички числа в интервала [0;1000) деляща се на 2x и да се запише като втора стойност в масива.
 Аналогично да се намери сумата на всички числа делящи се на Nx за N в интервала [1;10] и да се запишат като елемент N-1 в масива. Масивът да се изведе на стандартния изход.
*/

#include <stdio.h>

int main(){
    int x,i,j,n=1,y=1,count=0,b;
    int a=0,arr[10];
    printf("Enter a number(0<x<10): ");
    scanf("%d",&x);
    for(i=0;i<10;i++){
      arr[i]=0;
    }


    for(j=0;j<10;j++){
    for(i=1;i<1000;i++){
      if(i%(n*x)==0){
        b=b+i;

        }


      }
      if(count>10) break;
        count++;
      arr[y-1]=b;
      b=0;
      y++;
    n++;
   }
     for(i=0;i<10;i++){
      printf("Number: %d\n",arr[i]);
    }
    scanf("%d",x);
    return 0;
}
