// Училище: ТУЕС ( http://www.elsys-bg.org/ )
// Клас: 11 Б
// Номер: 16
// Име: Едуард Федев Калфов

/*Задача: Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10.
Да се инициализира масив от 10 елемента. Да се намери първото просто число в интервала [0; +∞) завършващо на x и да се запише като първи елемент в масива.
 Да се намери второто просто число в интервала [0;  +∞) завършващо на x и да се запише като втори елемент в масива.
Аналогично да се намерят първите N прости числа в интервала [0;  +∞) и да се запишат като елемент N в масива. Масивът да се изведе на стандартния изход.
*/

#include <stdio.h>


int checkPrime(int n){
   int c,isPrime=0;
   for ( c = 2 ; c <= n - 1 ; c++ ){
      if ( n%c == 0 ){
         break;
      }
   }
   if ( c == n ){
     isPrime=1;

   }
   return isPrime;
}

int main(){
      int x,i,j,n=1,y=0,count=0,b,c=0;
    int a=0,arr[10];
    printf("Enter a number(0<x<10): ");
    scanf("%d",&x);
    for(i=0;i<10;i++){
      arr[i]=0;
    }



    for(i=1;i<1000000;i++){
      c= i%10;
      if(checkPrime(i)==1 && c==x){
        if(count>10) break;
        count++;
        arr[y]=i;

        y++;
      }
    }


     for(i=0;i<10;i++){
      printf("Number: %d\n",arr[i]);
    }
    scanf("%d",x);


    return 0;
}
