// Училище: ТУЕС ( http://www.elsys-bg.org/ )
// Клас: 11 Б
// Номер: 16
// Име: Едуард Федев Калфов

/*Задача: Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10.
 Да се инициализира масив от 10 елемента. Да се намери първото число на Фибоначи в интервала [0; +∞) завършващо на x и да се запише като първи елемент в масива.
 Да се намери второто число на Фибоначи в интервала [0;  +∞) завършващо на x и да се запише като втори елемент в масива.
 Аналогично да се намерят първите N прости числа в интервала [0;  +∞) и да се запишат като елемент N в масива. Масивът да се изведе на стандартния изход.
*/

#include <stdio.h>

int main(){
     int x,i,j,n=1,y=0,count=0,a=0,b=1,c=0;
    int arr[10];
    printf("Enter a number(0<x<10): ");
    scanf("%d",&x);
    for(i=0;i<10;i++){
      arr[i]=0;
    }



   while(n<45){
      c= a+b;
      printf("%d\n",c);
      a=b;
      b=c;
      if(c%10==x){
        if(count>10) break;
        count++;
        arr[y]=c;
        y++;
      }
      n++;
    }


     for(i=0;i<10;i++){
      printf("Number: %d\n",arr[i]);
    }
    scanf("%d",x);



    return 0;
}
