// Училище: ТУЕС ( http://www.elsys-bg.org/ )
// Клас: 11 Б
// Номер: 16
// Име: Едуард Федев Калфов

/*Задача: Да се разработи програма, която изисква от потребителя да въведе целочислено число, x, където 0 < x < 10.
Да се инициализират масива от 10 елемента. Стойностите на елементите на масива да са равни на косинус от индекса на елемента.
 Да се изведе масивът, след което да се сортира в низходящ ред и отново да се изведе.
*/

#include <stdio.h>
#include <math.h>
#define PI 3.14159265
void sort(){
     int x,i;
     float a[10],temp;
     for(x=0;x<10;x++){
      a[x]=cos(x);
      printf("Unsorted array: %f\n",a[x]);
    }
     for(i=0;i<10;i++){
     for(x=0;x<=9;x++){
      if(a[x]<a[x+1] ){
          temp=a[x+1];
          a[x+1]=a[x];
          a[x]=temp;
      }
      }
      }
        for(x=0;x<10;x++){
         printf("Sorted array: %f\n",a[x]);

        }

}


int main(){
	int x,y,sum;



    sort();




	scanf("%d",sum);
	return 0;
}
