// Училище: ТУЕС ( http://www.elsys-bg.org/ )
// Клас: 11 Б
// Номер: 16
// Име: Едуард Федев Калфов

/*Задача: Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10.
Да се инициализира масив от 100 целочислени елемента.
Стойностите на елементите да са случайни числа в интервала [0, 100).
Елементите на масива да се подредят така, че числата завършващи на x да са в началото.

*/

#include <stdio.h>
#include <math.h>
#include <stdlib.h>
int main(){

    int x,y,z,r,i,temp;
    int a[100];

       printf("Enter a number(0<x<10): ");
       scanf("%d",&z);

    for(y=0;y<100;y++){
        r = rand()%100;
        a[y] = r;
    }
     for(i=0;i<1000;i++){

     for(x=0;x<=99;x++){

      if((a[x]%10)==z){

          temp=a[x];
          a[x]=a[x-1];
          a[x-1]=temp;
      }
      }
      }
    for(i=0;i<100;i++){
          printf("%d\n",a[i]);
                       }
scanf("%d",i);

 return 0;
}
