// Училище: ТУЕС ( http://www.elsys-bg.org/ )
// Клас: 11 Б
// Номер: 16
// Име: Едуард Федев Калфов

/*Задача: Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<=x<10.
Да се инициализира масив от 10 елемента. Да се намерят първите 10 стойности на функцията cos(x) в интервала [0; +∞), в които третата цифра след десетичната запетая е x.
Пример при cos(1) = 0.540302306 третата цифра след десетичната запетая е 0. При cos(2) = -0.416146837 третата цифра след десетичната запетая е 6.
Намерените стойности да се зададат като стойности на елементите в масива. Елементите на масива да се изведат на стандартния изход.
*/

#include <stdio.h>
#include <math.h>
int main(){
    int x,z,y,i,c=0,count=0;

    float a[10];
    for(z=0;z<10;z++){
      a[z]=0;
    }
    printf("Enter a number (0<=x<10): ");
    scanf("%d",&x);

    for(y=0;y<1000;y++){
          z=cos(y)*1000;
          i=z%10;


          if(i==x || i==-x){
            a[c]=cos(y);
             c=c+1;
             count++;
            if(count==10) break;
          }

    }
    for(i=0;i<10;i++){
      printf("Array %f\n",a[i]);
    }
    scanf("%d",x);
    return 0;
}
