// Училище: ТУЕС ( http://www.elsys-bg.org/ )
// Клас: 11 Б
// Номер: 16
// Име: Едуард Федев Калфов

/*Задача: Да се разработи програма, която изисква от потребителя да въведе число x, където 0<x<1. Да се намери числото пи чрез следното развитие в ред:
4-4/3+4/5-4/7+4/9-4/11+...4/N. Развитието в ред спира при 4/N<x. Получената стойност за пи да се изведе на екрана.

*/

#include <stdio.h>

int main(){
    int i,n=1;
    float x;
    float pi=4.0;
    printf("Enter a number(0<x<1): ");
    scanf("%f",&x);

    for(i=3; (float) 4/i > x;i+=2){
          if(n%2!=0){
             pi -= (float) 4/i;
          }
          else{
             pi += (float) 4/i;

          }
          n++;
    }
    printf("Pi: %f",pi);
    scanf("%d",i);
    return 0;
}
